Функция ПолучитьТаблицуКодовТНВЭД(ДатаАктуальности) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	втСвод.Номенклатура,
		|	ЕСТЬNULL(втСвод.Номенклатура.HScodeRussia, """") КАК КодТНВЭД,
		|	втСвод.ТекущаяСтавка
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		Номенклатура.Ссылка КАК Номенклатура,
		|		ЕСТЬNULL(ВложенныйЗапрос.СтавкаПошлины, 0) КАК ТекущаяСтавка
		|	ИЗ
		|		Справочник.Номенклатура КАК Номенклатура
		|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|				пр_СтавкиТаможеннойПошлиныНоменклатурыСрезПоследних.Номенклатура КАК Товар,
		|				пр_СтавкиТаможеннойПошлиныНоменклатурыСрезПоследних.СтавкаПошлины КАК СтавкаПошлины
		|			ИЗ
		|				РегистрСведений.пр_СтавкиТаможеннойПошлиныНоменклатуры.СрезПоследних(&ДатаАктуальности, ) КАК пр_СтавкиТаможеннойПошлиныНоменклатурыСрезПоследних) КАК ВложенныйЗапрос
		|			ПО Номенклатура.Ссылка = ВложенныйЗапрос.Товар
		|	ГДЕ
		|		НЕ Номенклатура.HScodeRussia = """") КАК втСвод
		|
		|УПОРЯДОЧИТЬ ПО
		|	КодТНВЭД";
		
	Запрос.УстановитьПараметр("ДатаАктуальности", ДатаАктуальности);
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Для каждого Стр Из ТЗ Цикл
		Стр.КодТНВЭД = СтрЗаменить(СтрЗаменить(Стр.КодТНВЭД," ",""),Символы.НПП,"");
	КонецЦикла; 
	
	ТЗ.Свернуть("Номенклатура,КодТНВЭД,ТекущаяСтавка");
	ТЗ.Сортировать("Номенклатура,КодТНВЭД,ТекущаяСтавка");
	
	Возврат ТЗ;
	
КонецФункции